{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": [64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa/c:/Users/uspaiaja/Ajay/BehaviorCloning/model.py\u00da\b<lambda>\r\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "trainable": true, "input_dtype": "float32", "name": "normalization", "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 24, "name": "conv2d_1", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_1", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 36, "name": "conv2d_2", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_2", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 48, "name": "conv2d_3", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "name": "conv2d_4", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_4", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout4", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "name": "conv2d_5", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_5", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout5", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "output_dim": 100, "bias": true, "input_dim": 576, "name": "fc1", "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_6", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout6", "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "output_dim": 50, "bias": true, "input_dim": 100, "name": "fc2", "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_7", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout7", "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "output_dim": 10, "bias": true, "input_dim": 50, "name": "fc3", "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "ELU_8", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout8", "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "output_dim": 1, "bias": true, "input_dim": 10, "name": "output_fc", "init": "he_normal"}}], "keras_version": "1.2.0"}